Revit 2026 API

# RebarFreeFormCreationResultRebar Property

---

Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a  Rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Rebar Rebar { get; }
```
```vb
Public ReadOnly Property Rebar As Rebar
	Get
```
```cpp
public:
property Rebar^ Rebar {
	Rebar^ get ();
}
```
```fsharp
member Rebar : Rebar with get
```

#### Property Value

Rebar

#### Reference

RebarFreeFormCreationResult Class

Autodesk.Revit.DB.Structure Namespace